Revit 2027 API
ImageExportOptions.GetViewsAndSheets Method
 Gets a list of views and sheets to be exported. Used only when ExportRange is SetOfViews.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public IList<ElementId> GetViewsAndSheets()
Public Function GetViewsAndSheets As IList(Of ElementId)
public:
IList<ElementId^>^ GetViewsAndSheets()
member GetViewsAndSheets : unit -> IList<ElementId>
Return Value
IList<ElementId>
 The ids of the views and sheets.
See Also
Reference
ImageExportOptions Class
Autodesk.Revit.DB Namespace